class Ohm
  BASE_DIGITS = <<-EOS.delete("\n")
0123456789
ABCDEFGHIJKLMNOPQRSTUVWXYZ
abcdefghijklmnopqrstuvwxyz
°¹²³⁴⁵⁶⁷⁸⁹
⁺⁻⁼⁽⁾ⁿ½⅓¼
←↑→↓↔↕
ıȷ×÷
£¥€ !"#$%&'()*+,-./:;<=>?@[\\]^_`{|}~¶
αβγδεζηθικλμνξοπρςστυφχψω
ΓΔΘΣΦΨΩ
ÀÁÂÃÄÅĀÆÈÉÊËÌÍÎÏÒÓÔÕÖØŒÙÚÛÜÇÐÑÝÞ
àáâãäåāæèéêëìíîïòóôõöøœùúûüçðñýþ
¿‽⁇⁈‼¡‰‱¦§©®±¬¢¤
«»‹›”‘’·‥…᠁∩∪⊂⊃
  EOS

  CODE_PAGE = <<-EOS.delete("\n")
°¹²³⁴⁵⁶⁷⁸⁹⁺⁻⁼⁽⁾ⁿ
½⅓¼←↑→↓↔↕ıȷ×÷£¥€
 !"#$%&'()*+,-./
0123456789:;<=>?
@ABCDEFGHIJKLMNO
PQRSTUVWXYZ[\\]^_
`abcdefghijklmno
pqrstuvwxyz{|}~¶
αβγδεζηθικλμνξπρ
ςστυφχψωΓΔΘΠΣΦΨΩ
ÀÁÂÃÄÅĀÆÈÉÊËÌÍÎÏ
ÒÓÔÕÖØŒÙÚÛÜÇÐÑÝÞ
àáâãäåāæèéêëìíîï
òóôõöøœùúûüçðñýþ
¿‽⁇⁈‼¡‰‱¦§©®±¬¢¤
«»‹›“”‘’·‥…᠁∩∪⊂⊃
  EOS

  OPENERS = %w(? : M £ » ⁇ ⁈ ‼ € ς ‘ ’ χ Å É ·Ω ·Θ)

  QUOTES = %w(" “ ”)

  DECIMAL_PRECISION = 10
end
